In [32]:
import pandas as pd

In [38]:
df=pd.read_csv("E:\\EXCEL WORK\\russian_passenger_air_service.csv")

In [57]:
df.shape

(3961, 16)

In [40]:
subset=df.loc[df['Year']==2020,['Airport name','Airport coordinates']]

In [41]:
subset.head(2)

  Airport name                            Airport coordinates
0       Abakan   (Decimal('91.399735'), Decimal('53.751351'))
1       Aikhal  (Decimal('111.543324'), Decimal('65.957161'))

# melt function we use to make wide dataset into long dataset

In [53]:
df_long=pd.melt(df,id_vars=['Airport name','Airport coordinates','Year','Whole year'],
                 var_name='Months',
                 value_name='Income'  
               )

In [62]:
df_long.tail(4)

,Airport name,Airport coordinates,Year,Whole year,Months,Income
47528,Yakutsk (Magan),"(Decimal('-6.226888'), Decimal('8.607871'))",2007,0.00,December,0.00
47529,Yamburg,"(Decimal('75.097783'), Decimal('67.980026'))",2007,55.59,December,8.87
47530,Yaroslavl (Tunoshna),"(Decimal('40.170054'), Decimal('57.56231'))",2007,15262.87,December,2055.60
47531,Yartsevo,"(Decimal('90.203907'), Decimal('60.252931'))",2007,0.00,December,0.00

In [56]:
df_long.shape

(47532, 6)

In [68]:
df_lonng=df_long[['Airport name','Airport coordinates','Year','Whole year','Months']]

In [71]:
df_lonng.drop_duplicates()

,Airport name,Airport coordinates,Year,Whole year,Months
0,Abakan,"(Decimal('91.399735'), Decimal('53.751351'))",2020,0.00,January
1,Aikhal,"(Decimal('111.543324'), Decimal('65.957161'))",2020,0.00,January
2,Loss,"(Decimal('125.398355'), Decimal('58.602489'))",2020,0.00,January
3,Amderma,"(Decimal('61.577429'), Decimal('69.759076'))",2020,0.00,January
4,Anadyr (Carbon),"(Decimal('177.738273'), Decimal('64.713433'))",2020,0.00,January
...,...,...,...,...,...
47527,Yakutsk,"(Decimal('129.750225'), Decimal('62.086594'))",2007,13577.44,December
47528,Yakutsk (Magan),"(Decimal('-6.226888'), Decimal('8.607871'))",2007,0.00,December
47529,Yamburg,"(Decimal('75.097783'), Decimal('67.980026'))",2007,55.59,December
47530,Yaroslavl (Tunoshna),"(Decimal('40.170054'), Decimal('57.56231'))",2007,15262.87,December
47531,Yartsevo,"(Decimal('90.203907'), Decimal('60.252931'))",2007,0.00,December